export const defaultModel = "gpt-3.5-turbo";

export const availableModels = [
  {
    value: "gpt-3.5-turbo",
    label: "GPT-3.5-TURBO (Default ChatGPT)",
  },
  { value: "gpt-3.5-turbo-0301", label: "GPT-3.5-TURBO-0301" },
  { value: "gpt-4", label: "GPT-4 (Limited Beta)" },
  { value: "gpt-4-0314", label: "GPT-4-0314 (Limited Beta)" },
  { value: "gpt-4-32k", label: "GPT-4-32K (Limited Beta)" },
  {
    value: "gpt-4-32k-0314",
    label: "GPT-4-32K-0314 (Limited Beta)",
  },
];
export const writingCharacters = [
  {
    label: "Комик",
    value:
      "Артист, который развлекает зрителей, рассказывая шутки и забавные истории.",
  },
  {
    label: "Тренер по жизни",
    value:
      "Профессионал, который помогает людям определиться и достичь своих личных и профессиональных целей.",
  },
  {
    label: "Консультант по карьере",
    value:
      "Профессионал, который помогает людям исследовать и выбирать карьеру, разрабатывать стратегии поиска работы и повышать свою производительность на рабочем месте.",
  },
  {
    label: "Диетолог",
    value:
      "Здравоохранительный работник, специализирующийся на изучении питания и его влиянии на организм.",
  },
  {
    label: "Менеджер по продуктам",
    value:
      "Профессионал, который контролирует разработку и маркетинг продуктов компании.",
  },
  {
    label: "Тренер по фитнесу",
    value:
      "Фитнес-профессионал, который помогает людям разрабатывать персональные программы тренировок и повышать их общее здоровье и физическую подготовку.",
  },
  {
    label: "Лайфхакер",
    value:
      "Человек, который использует нестандартные методы для решения проблем и повышения производительности в повседневной жизни.",
  },
  {
    label: "Туристический адвокат",
    value:
      "Профессионал, который помогает людям планировать и бронировать туристические услуги.",
  },
  {
    label: "Тренер по осознанности",
    value:
      "Профессионал, который помогает людям разрабатывать практику осознанности для снижения стресса и повышения благополучия.",
  },
  {
    label: "Финансовый консультант",
    value:
      "Профессионал, который предоставляет руководство и консультации о финансовом планировании, инвестиционных стратегиях и планировании на пенсию.",
  },
  {
    label: "Преподаватель иностранного языка",
    value:
      "Учитель, который помогает людям учить и улучшать свои навыки в иностранном языке.",
  },
  {
    label: "Туристический гид",
    value:
      "Профессионал, который проводит экскурсии и предоставляет информацию об интересных местах и культуре.",
  },
  {
    label: "Эксперт по маркетингу",
    value:
      "Профессионал, который разрабатывает и внедряет маркетинговые стратегии для продвижения продуктов и услуг.",
  },
  {
    label: "Разработчик программного обеспечения",
    value:
      "Профессионал, который проектирует, разрабатывает и поддерживает программные приложения и системы.",
  },
  {
    label: "Дэйт-коуч",
    value:
      "Профессионал, который помогает людям улучшать свои навыки в области знакомств и отношений.",
  },
  {
    label: "Эксперт по переделке",
    value:
      "Человек, который имеет опыт в выполнении самых разных задач самостоятельного ремонта дома.",
  },
  {
    label: "Журналист",
    value:
      "Профессионал, который занимается расследованиями и освещением актуальных событий и новостей.",
  },
  {
    label: "Технический писатель",
    value:
      "Профессионал, который пишет статьи о технологиях и смежных темах для различных читателей.",
  },
  {
    label: "Профессиональный шеф-повар",
    value:
      "Квалифицированный кулинарный специалист, который готовит блюда и контролирует работу кухни.",
  },
  {
    label: "Профессиональный продавец",
    value:
      "Профессионал, который продает товары и услуги для бизнеса и потребителей.",
  },
  {
    label: "Юрист по стартапам",
    value:
      "Юридический специалист, специализирующийся на правовом консультировании и предоставлении услуг стартапам в области технологий.",
  },
  {
    label: "Графический дизайнер",
    value:
      "Профессионал по созданию визуальных материалов, таких как логотипы, буклеты и сайты.",
  },
  {
    label: "Академический исследователь",
    value:
      "Профессионал, который занимается исследованиями и созданием научных работ в определенной области академии.",
  },
  {
    label: "Специалист по поддержке клиентов",
    value:
      "Профессионал, который предоставляет помощь и поддержку клиентам, у которых возникают вопросы или проблемы с продуктами или услугами компании.",
  },
  {
    label: "Консультант по кадровому делу",
    value:
      "Профессионал, который предоставляет консультации и рекомендации организациям по вопросам управления человеческими ресурсами и стратегии",
  },
];

export const writingTones = [
  "Уверенный",
  "Авторитетный",
  "Неформальный",
  "Убеждённый",
  "Высокомерный",
  "Разговорный",
  "Дипломатичный",
  "Прямой",
  "Красноречивый",
  "Формальный",
  "Дружелюбный",
  "Юмористический",
  "Информативный",
  "Вдохновляющий",
  "Интенсивный",
  "Раздражительный",
  "Шутливый",
  "Вежливый",
  "Саркастический",
  "Искренний",
  "Успокаивающий",
  "Строгий",
  "Сочувствующий",
  "Тактичный",
  "Остроумный",
];

export const writingStyles = [
  "Академический",
  "Аргументативный",
  "Аналитический",
  "Разговорный",
  "Творческий",
  "Критический",
  "Описательный",
  "Пояснительный",
  "Информативный",
  "Инструктивный",
  "Исследовательский",
  "Журналистский",
  "Метафорический",
  "Нарративный",
  "Убедительный",
  "Поэтический",
  "Сатирический",
  "Технический",
];

export const writingFormats = [
  { value: "Ответьте как можно кратче", label: "Кратко" },
  { value: "Думайте шаг за шагом", label: "Пошагово" },
  {
    value: "Ответьте с максимальными подробностями",
    label: "Максимальная детализация",
  },
  {
    value: "Объясните мне, как пятилетнему ребенку",
    label: "Объясните, как пятилетнему",
  },
];
